var templateNode = document.getElementById('articles-template');
var templateString = templateNode.innerHTML;

var template = Handlebars.compile(templateString);

var articles = [{
	id: 1,
	title: 'Стайна хризантема',
	imgUrl: 'img/chrysanthemum.jpg',
	content: 'Това растение (Chrysanthemum morifolium) е любимец на NASA. Именно тези цветя използват за пречистване на въздуха в офисите на космическото агентство. Те ефективно поглъщат амоняк, бензол и формалдехид от въдуха във всяко помещение. Хризантемата не е типичното стайно растение, но с редовно поливане и поставени на подходящо място могат дълго време да "работят" за нас. При това цветето не е скъпо и след като прецъфти е идеален вариант за цветната ни леха в двора.',
	postDate: '02-03-2016'
},{
	id: 2,
	title: 'Хлорофитум',
	imgUrl: 'img/chlorofitum.jpg',
	content: 'Хлорофитумът (Chlorophytum comosum) е просто и непретенциозно растение, което не изисква специални грижи. Наричат го още зелена лилия, заради обилната зелена маса и малките бели цветчета. Вирее и на светло, и на сянка, стига да се полива редовно. То е доста широко разпространено, така че вероятно всеки може да помоли за една -две розетки от съседката. Хлорофитумът ефективно поглъща всички химикали, с които пръскаме, когато почистваме дома си.',
	postDate: '03-03-2016'
},{
	id: 3,
	title: 'Драцена',
	imgUrl: 'img/Dracena.jpg',
	content: 'В света има повече от 40 вида от това растение. Затова лесно можем да намерим онзи вид, който външно ни харесва най-много. Драцената се справя отлично с бензол, трихлоретилен и ксилол от въздуха. Вярно е, че тези цветя са малко токсични за котки и кучета. Така че, ако имате малко жилище и в него има домашни любимци, помислете преди да си вземете драцена вкъщи.'
},{
	id: 4,
	title: 'Фикус Бенджамин',
	imgUrl: 'img/ficus.jpg',
	content: 'Фикусът ( Ficus Benjamina) е най-популярното домашно мини-дърво. Ако го засадим в голям съд и му осигурим добри условия, той може да порасне наистина до внушителни размери. Като правило обаче средно фикусът е висок от 60 до 120 см. Бенджамин Golden King - е с обагрени с жълто по краищата листа. Бенджамин Midnight Lady е с тъмно зелени листа. Бенджамин Naomi - с тъмно зелени листа накъдрени по краищата. Бенджамин Samantha - с тъмно зелени листа и светло зелени ръбове на листата. Листата на бенджамин Starlight са обагрени с бяло по краищата. През пролетта и лятото можем да изнесем растението навън - на двора или на балкона.',
	postDate: '05-03-2016'
},{
	id: 5,
	title: 'Спатифилиум ',
	imgUrl: 'img/spatifillum.jpg',
	content: 'Спатифилиумът (Spathiphyllum) е едно наистина красиво цъфтящо цвете, при това дори да искаме да го "уморим", ще трябва доста да се потрудим. Спатифилиумът цъфти предимно през лятото. Заради елегантните му бели цветове го наричат бяло фламинго. Неговата родина са влажните тропически гори на Централна и Южна Америка. Познати са 36 вида. Предпочита сенчесто място и влажна, но не подгизнала почва, не обича течение. Успешно отстранява от въздуха амоняк, бензол, формалдехид и трихлоретилен. ',
	postDate: '09-03-2016'
},{
	id: 6,
	title: 'Папрат нефролепсис ',
	imgUrl: 'img/paprat.jpg',
	content: 'Това растение обича прохладни места с висока влажност и отразена светлина. Банята е идеално място за този "помощник". Той чисти въздуха от замърсяващото вещество ксилол.'
},{
	id: 7,
	title: 'Сансевиера (Свекървин език)',
	imgUrl: 'img/sansviera.jpg',
	content: 'Саксии с това растение виждаме често навсякъде - в офиси, магазини и ресторанти. И това е така не напразно - сансевиерата не изисква почти никакви грижи. Трябва да поливаме поне веднъж в месеца - растенията обичат сухи условия. Нямат нужда и от голямо количество слънчева светлина.',
	postDate: '12-03-2016'
},{
	id: 8,
	title: 'Хамедорея (Бамбукова палма)',
	imgUrl: 'img/chlorofitum.jpg',
	content: 'Това е най-доброто средство в света за пречистване на въздуха от формалдехид. За начало е най-добре да го поставим на перваза на слънчев прозорец. В отговор ще получим палма с височина до 3 м и свеж въздух. Изглежда прекрасно.',
	postDate: '18-03-2016'
},{
	id: 9,
	title: 'Алое вера',
	imgUrl: 'img/aloe.jpg',
	content: 'Това е многофункционално растение. С него можем да лекуваме изгаряния, простуда и просто да пречистим въздуха в стаята. Едно растение може да вдъхне нов живот във всяко едно малко жилище. Поради това, че алоето съдържа 95% вода, то е изключително топлолюбиво и неустойчиво на студ. Растението е светлолюбиво, почвата трябва да бъде умерено наторена и силно дренирана. През лятото се полива умерено. От пролетта до късна есен може да се държи навън - в градината или на балкона. През зимата се нуждае от светло и прохладно място и се полива крайно умерено, за да не засъхнат корените му.'
}];

var articleHTML = template({articles: articles});
document.body.innerHTML += articleHTML;